balazsgrill/modembed/res/Devices/dsPIC33/DSPIC33FJ64GP708A.PIC
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="C2FMSKSEL2" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="C2FMSKSEL2" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="F8MSK" edc:desc="" edc:mask="0x3" edc:name="F8MSK" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="F9MSK" edc:desc="" edc:mask="0x3" edc:name="F9MSK" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="F10MSK" edc:desc="" edc:mask="0x3" edc:name="F10MSK" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="F11MSK" edc:desc="" edc:mask="0x3" edc:name="F11MSK" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="F12MSK" edc:desc="" edc:mask="0x3" edc:name="F12MSK" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="F13MSK" edc:desc="" edc:mask="0x3" edc:name="F13MSK" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="F14MSK" edc:desc="" edc:mask="0x3" edc:name="F14MSK" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="F15MSK" edc:desc="" edc:mask="0x3" edc:name="F15MSK" edc:nzwidth="0x2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="F8MSK0" edc:desc="" edc:mask="0x1" edc:name="F8MSK0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F8MSK1" edc:desc="" edc:mask="0x1" edc:name="F8MSK1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F9MSK0" edc:desc="" edc:mask="0x1" edc:name="F9MSK0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F9MSK1" edc:desc="" edc:mask="0x1" edc:name="F9MSK1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F10MSK0" edc:desc="" edc:mask="0x1" edc:name="F10MSK0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F10MSK1" edc:desc="" edc:mask="0x1" edc:name="F10MSK1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F11MSK0" edc:desc="" edc:mask="0x1" edc:name="F11MSK0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F11MSK1" edc:desc="" edc:mask="0x1" edc:name="F11MSK1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F12MSK0" edc:desc="" edc:mask="0x1" edc:name="F12MSK0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F12MSK1" edc:desc="" edc:mask="0x1" edc:name="F12MSK1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F13MSK0" edc:desc="" edc:mask="0x1" edc:name="F13MSK0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F13MSK1" edc:desc="" edc:mask="0x1" edc:name="F13MSK1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F14MSK0" edc:desc="" edc:mask="0x1" edc:name="F14MSK0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F14MSK1" edc:desc="" edc:mask="0x1" edc:name="F14MSK1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F15MSK0" edc:desc="" edc:mask="0x1" edc:name="F15MSK0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F15MSK1" edc:desc="" edc:mask="0x1" edc:name="F15MSK1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="4"/>
        <edc:MuxedSFRDef edc:nzwidth="0x10">
          <edc:SelectSFR edc:when="($0x500 &amp; 0x1) == 0x1">
            <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="C2BUFPNT1" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="C2BUFPNT1" edc:nmmrid="0x54" edc:nzwidth="0x10" edc:por="0000000000000000">
              <edc:SFRModeList>
                <edc:SFRMode edc:id="DS.0">
                  <edc:SFRFieldDef edc:cname="F0BP" edc:desc="" edc:mask="0xf" edc:name="F0BP" edc:nzwidth="0x4"/>
                  <edc:SFRFieldDef edc:cname="F1BP" edc:desc="" edc:mask="0xf" edc:name="F1BP" edc:nzwidth="0x4"/>
                  <edc:SFRFieldDef edc:cname="F2BP" edc:desc="" edc:mask="0xf" edc:name="F2BP" edc:nzwidth="0x4"/>
                  <edc:SFRFieldDef edc:cname="F3BP" edc:desc="" edc:mask="0xf" edc:name="F3BP" edc:nzwidth="0x4"/>
                </edc:SFRMode>
                <edc:SFRMode edc:id="LT.0">
                  <edc:SFRFieldDef edc:cname="F0BP0" edc:desc="" edc:mask="0x1" edc:name="F0BP0" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F0BP1" edc:desc="" edc:mask="0x1" edc:name="F0BP1" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F0BP2" edc:desc="" edc:mask="0x1" edc:name="F0BP2" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F0BP3" edc:desc="" edc:mask="0x1" edc:name="F0BP3" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F1BP0" edc:desc="" edc:mask="0x1" edc:name="F1BP0" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F1BP1" edc:desc="" edc:mask="0x1" edc:name="F1BP1" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F1BP2" edc:desc="" edc:mask="0x1" edc:name="F1BP2" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F1BP3" edc:desc="" edc:mask="0x1" edc:name="F1BP3" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F2BP0" edc:desc="" edc:mask="0x1" edc:name="F2BP0" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F2BP1" edc:desc="" edc:mask="0x1" edc:name="F2BP1" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F2BP2" edc:desc="" edc:mask="0x1" edc:name="F2BP2" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F2BP3" edc:desc="" edc:mask="0x1" edc:name="F2BP3" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F3BP0" edc:desc="" edc:mask="0x1" edc:name="F3BP0" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F3BP1" edc:desc="" edc:mask="0x1" edc:name="F3BP1" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F3BP2" edc:desc="" edc:mask="0x1" edc:name="F3BP2" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F3BP3" edc:desc="" edc:mask="0x1" edc:name="F3BP3" edc:nzwidth="1"/>
                </edc:SFRMode>
              </edc:SFRModeList>
            </edc:SFRDef>
          </edc:SelectSFR>
          <edc:SelectSFR>
            <edc:SFRDef edc:access="cccccccccccccccc" edc:cname="C2RXFUL1" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="C2RXFUL1" edc:nzwidth="0x10" edc:por="0000000000000000">
              <edc:AliasList/>
              <edc:SFRModeList>
                <edc:SFRMode edc:id="DS.0">
                  <edc:SFRFieldDef edc:cname="RXFUL0" edc:desc="" edc:mask="0x1" edc:name="RXFUL0" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL1" edc:desc="" edc:mask="0x1" edc:name="RXFUL1" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL2" edc:desc="" edc:mask="0x1" edc:name="RXFUL2" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL3" edc:desc="" edc:mask="0x1" edc:name="RXFUL3" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL4" edc:desc="" edc:mask="0x1" edc:name="RXFUL4" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL5" edc:desc="" edc:mask="0x1" edc:name="RXFUL5" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL6" edc:desc="" edc:mask="0x1" edc:name="RXFUL6" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL7" edc:desc="" edc:mask="0x1" edc:name="RXFUL7" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL8" edc:desc="" edc:mask="0x1" edc:name="RXFUL8" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL9" edc:desc="" edc:mask="0x1" edc:name="RXFUL9" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL10" edc:desc="" edc:mask="0x1" edc:name="RXFUL10" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL11" edc:desc="" edc:mask="0x1" edc:name="RXFUL11" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL12" edc:desc="" edc:mask="0x1" edc:name="RXFUL12" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL13" edc:desc="" edc:mask="0x1" edc:name="RXFUL13" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL14" edc:desc="" edc:mask="0x1" edc:name="RXFUL14" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL15" edc:desc="" edc:mask="0x1" edc:name="RXFUL15" edc:nzwidth="0x1"/>
                </edc:SFRMode>
              </edc:SFRModeList>
              <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
            </edc:SFRDef>
          </edc:SelectSFR>
        </edc:MuxedSFRDef>
        <edc:MuxedSFRDef edc:nzwidth="0x10">
          <edc:SelectSFR edc:when="($0x500 &amp; 0x1) == 0x1">
            <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="C2BUFPNT2" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="C2BUFPNT2" edc:nmmrid="0x56" edc:nzwidth="0x10" edc:por="0000000000000000">
              <edc:SFRModeList>
                <edc:SFRMode edc:id="DS.0">
                  <edc:SFRFieldDef edc:cname="F4BP" edc:desc="" edc:mask="0xf" edc:name="F4BP" edc:nzwidth="0x4"/>
                  <edc:SFRFieldDef edc:cname="F5BP" edc:desc="" edc:mask="0xf" edc:name="F5BP" edc:nzwidth="0x4"/>
                  <edc:SFRFieldDef edc:cname="F6BP" edc:desc="" edc:mask="0xf" edc:name="F6BP" edc:nzwidth="0x4"/>
                  <edc:SFRFieldDef edc:cname="F7BP" edc:desc="" edc:mask="0xf" edc:name="F7BP" edc:nzwidth="0x4"/>
                </edc:SFRMode>
                <edc:SFRMode edc:id="LT.0">
                  <edc:SFRFieldDef edc:cname="F4BP0" edc:desc="" edc:mask="0x1" edc:name="F4BP0" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F4BP1" edc:desc="" edc:mask="0x1" edc:name="F4BP1" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F4BP2" edc:desc="" edc:mask="0x1" edc:name="F4BP2" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F4BP3" edc:desc="" edc:mask="0x1" edc:name="F4BP3" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F5BP0" edc:desc="" edc:mask="0x1" edc:name="F5BP0" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F5BP1" edc:desc="" edc:mask="0x1" edc:name="F5BP1" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F5BP2" edc:desc="" edc:mask="0x1" edc:name="F5BP2" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F5BP3" edc:desc="" edc:mask="0x1" edc:name="F5BP3" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F6BP0" edc:desc="" edc:mask="0x1" edc:name="F6BP0" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F6BP1" edc:desc="" edc:mask="0x1" edc:name="F6BP1" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F6BP2" edc:desc="" edc:mask="0x1" edc:name="F6BP2" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F6BP3" edc:desc="" edc:mask="0x1" edc:name="F6BP3" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F7BP0" edc:desc="" edc:mask="0x1" edc:name="F7BP0" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F7BP1" edc:desc="" edc:mask="0x1" edc:name="F7BP1" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F7BP2" edc:desc="" edc:mask="0x1" edc:name="F7BP2" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F7BP3" edc:desc="" edc:mask="0x1" edc:name="F7BP3" edc:nzwidth="1"/>
                </edc:SFRMode>
              </edc:SFRModeList>
            </edc:SFRDef>
          </edc:SelectSFR>
          <edc:SelectSFR>
            <edc:SFRDef edc:access="cccccccccccccccc" edc:cname="C2RXFUL2" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="C2RXFUL2" edc:nzwidth="0x10" edc:por="0000000000000000">
              <edc:AliasList/>
              <edc:SFRModeList>
                <edc:SFRMode edc:id="DS.0">
                  <edc:SFRFieldDef edc:cname="RXFUL16" edc:desc="" edc:mask="0x1" edc:name="RXFUL16" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL17" edc:desc="" edc:mask="0x1" edc:name="RXFUL17" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL18" edc:desc="" edc:mask="0x1" edc:name="RXFUL18" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL19" edc:desc="" edc:mask="0x1" edc:name="RXFUL19" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL20" edc:desc="" edc:mask="0x1" edc:name="RXFUL20" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL21" edc:desc="" edc:mask="0x1" edc:name="RXFUL21" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL22" edc:desc="" edc:mask="0x1" edc:name="RXFUL22" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL23" edc:desc="" edc:mask="0x1" edc:name="RXFUL23" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL24" edc:desc="" edc:mask="0x1" edc:name="RXFUL24" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL25" edc:desc="" edc:mask="0x1" edc:name="RXFUL25" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL26" edc:desc="" edc:mask="0x1" edc:name="RXFUL26" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL27" edc:desc="" edc:mask="0x1" edc:name="RXFUL27" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL28" edc:desc="" edc:mask="0x1" edc:name="RXFUL28" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL29" edc:desc="" edc:mask="0x1" edc:name="RXFUL29" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL30" edc:desc="" edc:mask="0x1" edc:name="RXFUL30" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL31" edc:desc="" edc:mask="0x1" edc:name="RXFUL31" edc:nzwidth="0x1"/>
                </edc:SFRMode>
              </edc:SFRModeList>
              <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
            </edc:SFRDef>
          </edc:SelectSFR>
        </edc:MuxedSFRDef>
        <edc:MuxedSFRDef edc:nzwidth="0x10">
          <edc:SelectSFR edc:when="($0x500 &amp; 0x1) == 0x1">
            <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="C2BUFPNT3" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="C2BUFPNT3" edc:nmmrid="0x58" edc:nzwidth="0x10" edc:por="0000000000000000">
              <edc:SFRModeList>
                <edc:SFRMode edc:id="DS.0">
                  <edc:SFRFieldDef edc:cname="F8BP" edc:desc="" edc:mask="0xf" edc:name="F8BP" edc:nzwidth="0x4"/>
                  <edc:SFRFieldDef edc:cname="F9BP" edc:desc="" edc:mask="0xf" edc:name="F9BP" edc:nzwidth="0x4"/>
                  <edc:SFRFieldDef edc:cname="F10BP" edc:desc="" edc:mask="0xf" edc:name="F10BP" edc:nzwidth="0x4"/>
                  <edc:SFRFieldDef edc:cname="F11BP" edc:desc="" edc:mask="0xf" edc:name="F11BP" edc:nzwidth="0x4"/>
                </edc:SFRMode>
                <edc:SFRMode edc:id="LT.0">
                  <edc:SFRFieldDef edc:cname="F8BP0" edc:desc="" edc:mask="0x1" edc:name="F8BP0" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F8BP1" edc:desc="" edc:mask="0x1" edc:name="F8BP1" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F8BP2" edc:desc="" edc:mask="0x1" edc:name="F8BP2" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F8BP3" edc:desc="" edc:mask="0x1" edc:name="F8BP3" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F9BP0" edc:desc="" edc:mask="0x1" edc:name="F9BP0" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F9BP1" edc:desc="" edc:mask="0x1" edc:name="F9BP1" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F9BP2" edc:desc="" edc:mask="0x1" edc:name="F9BP2" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F9BP3" edc:desc="" edc:mask="0x1" edc:name="F9BP3" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F10BP0" edc:desc="" edc:mask="0x1" edc:name="F10BP0" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F10BP1" edc:desc="" edc:mask="0x1" edc:name="F10BP1" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F10BP2" edc:desc="" edc:mask="0x1" edc:name="F10BP2" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F10BP3" edc:desc="" edc:mask="0x1" edc:name="F10BP3" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F11BP0" edc:desc="" edc:mask="0x1" edc:name="F11BP0" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F11BP1" edc:desc="" edc:mask="0x1" edc:name="F11BP1" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F11BP2" edc:desc="" edc:mask="0x1" edc:name="F11BP2" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F11BP3" edc:desc="" edc:mask="0x1" edc:name="F11BP3" edc:nzwidth="1"/>
                </edc:SFRMode>
              </edc:SFRModeList>
            </edc:SFRDef>
          </edc:SelectSFR>
          <edc:SelectSFR/>
        </edc:MuxedSFRDef>
        <edc:MuxedSFRDef edc:nzwidth="0x10">
          <edc:SelectSFR edc:when="($0x500 &amp; 0x1) == 0x1">
            <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="C2BUFPNT4" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="C2BUFPNT4" edc:nmmrid="0x5a" edc:nzwidth="0x10" edc:por="0000000000000000">
              <edc:SFRModeList>
                <edc:SFRMode edc:id="DS.0">
                  <edc:SFRFieldDef edc:cname="F12BP" edc:desc="" edc:mask="0xf" edc:name="F12BP" edc:nzwidth="0x4"/>
                  <edc:SFRFieldDef edc:cname="F13BP" edc:desc="" edc:mask="0xf" edc:name="F13BP" edc:nzwidth="0x4"/>
                  <edc:SFRFieldDef edc:cname="F14BP" edc:desc="" edc:mask="0xf" edc:name="F14BP" edc:nzwidth="0x4"/>
                  <edc:SFRFieldDef edc:cname="F15BP" edc:desc="" edc:mask="0xf" edc:name="F15BP" edc:nzwidth="0x4"/>
                </edc:SFRMode>
                <edc:SFRMode edc:id="LT.0">
                  <edc:SFRFieldDef edc:cname="F12BP0" edc:desc="" edc:mask="0x1" edc:name="F12BP0" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F12BP1" edc:desc="" edc:mask="0x1" edc:name="F12BP1" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F12BP2" edc:desc="" edc:mask="0x1" edc:name="F12BP2" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F12BP3" edc:desc="" edc:mask="0x1" edc:name="F12BP3" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F13BP0" edc:desc="" edc:mask="0x1" edc:name="F13BP0" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F13BP1" edc:desc="" edc:mask="0x1" edc:name="F13BP1" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F13BP2" edc:desc="" edc:mask="0x1" edc:name="F13BP2" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F13BP3" edc:desc="" edc:mask="0x1" edc:name="F13BP3" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F14BP0" edc:desc="" edc:mask="0x1" edc:name="F14BP0" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F14BP1" edc:desc="" edc:mask="0x1" edc:name="F14BP1" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F14BP2" edc:desc="" edc:mask="0x1" edc:name="F14BP2" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F14BP3" edc:desc="" edc:mask="0x1" edc:name="F14BP3" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F15BP0" edc:desc="" edc:mask="0x1" edc:name="F15BP0" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F15BP1" edc:desc="" edc:mask="0x1" edc:name="F15BP1" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F15BP2" edc:desc="" edc:mask="0x1" edc:name="F15BP2" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F15BP3" edc:desc="" edc:mask="0x1" edc:name="F15BP3" edc:nzwidth="1"/>
                </edc:SFRMode>
              </edc:SFRModeList>
            </edc:SFRDef>
          </edc:SelectSFR>
          <edc:SelectSFR/>
        </edc:MuxedSFRDef>
        <edc:SFRDef edc:access="cccccccccccccccc" edc:cname="C2RXOVF1" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="C2RXOVF1" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXOVF0" edc:desc="" edc:mask="0x1" edc:name="RXOVF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXOVF1" edc:desc="" edc:mask="0x1" edc:name="RXOVF1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXOVF2" edc:desc="" edc:mask="0x1" edc:name="RXOVF2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXOVF3" edc:desc="" edc:mask="0x1" edc:name="RXOVF3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXOVF4" edc:desc="" edc:mask="0x1" edc:name="RXOVF4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXOVF5" edc:desc="" edc:mask="0x1" edc:name="RXOVF5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXOVF6" edc:desc="" edc:mask="0x1" edc:name="RXOVF6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXOVF7" edc:desc="" edc:mask="0x1" edc:name="RXOVF7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXOVF8" edc:desc="" edc:mask="0x1" edc:name="RXOVF8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXOVF9" edc:desc="" edc:mask="0x1" edc:name="RXOVF9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXOVF10" edc:desc="" edc:mask="0x1" edc:name="RXOVF10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXOVF11" edc:desc="" edc:mask="0x1" edc:name="RXOVF11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXOVF12" edc:desc="" edc:mask="0x1" edc:name="RXOVF12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXOVF13" edc:desc="" edc:mask="0x1" edc:name="RXOVF13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXOVF14" edc:desc="" edc:mask="0x1" edc:name="RXOVF14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXOVF15" edc:desc="" edc:mask="0x1" edc:name="RXOVF15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
